Revit 2027 API
TemporaryViewModes.GetCaption Method
 A text caption to use for the given mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetCaption(
	TemporaryViewMode mode
)
Public Function GetCaption (
	mode As TemporaryViewMode
) As String
public:
String^ GetCaption(
	TemporaryViewMode mode
)
member GetCaption :
        mode : TemporaryViewMode -> string
Parameters
mode TemporaryViewMode
 The mode to get a caption for.
Return Value
String
 Text of the caption. The text is localized.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The text appears in the UI on the temporary frame when the view is in the temporary mode.
See Also
Reference
TemporaryViewModes Class
Autodesk.Revit.DB Namespace